Repository: shahryar-cmyk/salahSnap
Catalog: lib/l10n/app_*.arb
Languages: ur

# appTitle
source: Salat Snap
ur: صلاح سنیپ

# appNameSalat
source: Salat
ur: صلاۃ

# appNameSnap
source: Snap
ur: سنیپ

# appName
source: Salat Snap
ur: صلاح سنیپ

source: Get Started
ur: شروع کریں

source: Loading...
ur: لوڈ ہو رہا ہے

source: Language
ur: زبان

source: Change Language
ur: زبان تبدیل کریں

# languageSubtitle
source: Change app language
ur: ایپ کی زبان تبدیل کریں

# prayerTimesTitle
source: Prayer Times
ur: نماز کے اوقات

source: Set Alarms
ur: الارم سیٹ کریں

source: Set Alarm
ur: الارم سیٹ کریں

source: Setting
ur: سیٹنگ

source: Close
ur: بند کریں

source: Cancel
ur: منسوخ

source: Save
ur: محفوظ کریں

source: Camera
ur: کیمرا

source: Gallery
ur: گیلری

source: Captured Image
ur: محفوظ شدہ تصویر

source: Step 1: Image Preview
ur: مرحلہ 1: تصویر کا پیش نظارہ

source: Change Image
ur: تصویر تبدیل کریں

source: Process
ur: پروسیس کریں

source: Edit Prayer Times
ur: نماز کے اوقات میں ترمیم

# imageAndOcrResult
source: Image & OCR Result
ur: تصویر اور OCR نتیجہ

source: Remove alphabets
ur: حروف ہٹا دیں

# rawExtractedText
source: Raw Extracted Text (Tap to edit times):
ur: خام متن (اوقات میں ترمیم کیلئے ٹیپ کریں):

# clickSnapSetAlarms
source: Click a snap and set alarms
ur: تصویر لیں اور الارم سیٹ کریں

source: About Us
ur: ہمارے بارے میں

# aboutUsSubtitle
source: Learn more about Salat Snap
ur: صلاح سنیپ کے بارے میں مزید جانیں

source: Contact Us
ur: ہم سے رابطہ کریں

# contactUsSubtitle
source: Get in touch with us
ur: ہم سے رابطہ کریں

source: Dashboard
ur: ڈیش بورڈ

source: Profile
ur: پروفائل

source: Meal Planner
ur: میل پلانر

# profileThankYouTitle
source: Thank you for supporting us!
ur: آپ کی حمایت کا شکریہ!

# profileThankYouDesc
source: As a local business, we thank you for supporting us and hope you enjoy.
ur: ایک مقامی کاروبار کے طور پر، ہم آپ کی حمایت کے شکر گزار ہیں اور امید کرتے ہیں کہ آپ کو ہماری سروس پسند آئے گی۔

# aboutIntro
source: Welcome to Salat Snap – a smart and easy-to-use Islamic app designed to help Muslims stay punctual with their prayers, wherever they are in the world.
ur: صلاح سنیپ ایک جدید اور آسان اسلامی ایپ ہے جو مسلمانوں کو دنیا کے کسی بھی حصے میں اپنی نمازوں کے اوقات کی پابندی میں مدد دیتی ہے۔

# aboutDetails
source: Salat Snap introduces a modern and convenient way to set prayer times using QR code scanning. Simply scan the QR code provided on your prayer timetable or mosque display, and the app will instantly fetch accurate prayer times. Once scanned, Salat Snap automatically sets alarms for all five daily prayers — Fajr, Dhuhr, Asr, Maghrib, Isha — along with Jumuah on Fridays. No manual entry, no complicated setup — just scan, confirm, and stay connected with your prayers.
ur: صلاح سنیپ نماز کے اوقات مقرر کرنے کا ایک جدید طریقہ فراہم کرتی ہے۔ بس نماز کے اوقات پر موجود QR کوڈ اسکین کریں، اور ایپ فوری طور پر درست نماز کے اوقات حاصل کر لے گی۔ QR کوڈ اسکین کرنے کے بعد، صلاح سنیپ خودکار طور پر پانچوں نمازوں — فجر، ظہر، عصر، مغرب، عشاء — اور جمعہ کی نماز کے لیے الارم سیٹ کر دیتی ہے۔ نہ دستی اندراج، نہ پیچیدہ سیٹنگ — بس اسکین کریں، تصدیق کریں اور نماز سے جڑے رہیں۔

# aboutBeliefTitle
source: Our Mission:
ur: ہمارا مقصد:

# aboutQuoteAuthor
source: Chef Ron
ur: شیف رون

# aboutQuoteText
source: “Prayer is the pillar of faith.” Salat Snap helps you protect this pillar with simplicity, accuracy, and ease.
ur: “نماز دین کا ستون ہے۔” صلاح سنیپ آپ کو اس ستون کی حفاظت میں آسانی اور درستگی کے ساتھ مدد فراہم کرتی ہے۔

# contactAddress
source: 123 Example St, City, State 12345
ur: 123 مثال اسٹریٹ، شہر، ریاست 12345

# onboardTitle1
source: Scan QR code to get prayer times
ur: QR کوڈ اسکین کر کے نماز کے اوقات حاصل کریں

# onboardSubtitle1
source: Instantly fetch accurate prayer times
ur: فوری طور پر درست نماز کے اوقات حاصل کریں

# onboardTitle2
source: Auto set prayer alarms
ur: نماز کے الارمز خودکار طور پر سیٹ کریں

# onboardSubtitle2
source: All prayer alarms set automatically in one scan
ur: ایک ہی اسکین میں تمام نمازوں کے الارمز سیٹ ہو جائیں

# continueBtn
source: Continue
ur: جاری رکھیں
